Revit 2026 API

# RailJoinOption Enumeration

---

The join type of the system rails.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum RailJoinOption
```
```vb
Public Enumeration RailJoinOption
```
```cpp
public enum class RailJoinOption
```
```fsharp
type RailJoinOption
```

| Member name | Value | Description |
| --- | --- | --- |
| ByType | -1 | The rails will be joined according to the settings in the rail type. |
| Fillet | 1 | The rails will be joined by a fillet connection. |
| Miter | 0 | The rails will be joined by a miter connection. |

#### Reference

Autodesk.Revit.DB.Architecture Namespace